---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.AirSystemData.PreheatHotWaterLoopId
source: html/402223f4-7f05-ce66-bed6-94821f07b7e5.htm
---
# Autodesk.Revit.DB.Mechanical.AirSystemData.PreheatHotWaterLoopId Property

The water loop element id for the hot-water preheat coil.

## Syntax (C#)
```csharp
public ElementId PreheatHotWaterLoopId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null